<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="flatten_input" type="Parameter" version="opset1">
			<data shape="1, 784" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,flatten_input:0">
					<dim>1</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/sequential/flatten/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="0" size="16"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/sequential/flatten/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/sequential/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/flatten/Reshape:0">
					<dim>1</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="512, 784" offset="16" size="1605632"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp:0">
					<dim>512</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense/MatMul:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="1605648" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential/dense/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential/dense/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/dense/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="1607696" size="1048576"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_1/MatMul:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="2656272" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential/dense_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_1/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/dense_1/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="10, 512" offset="2658320" size="20480"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp:0">
					<dim>10</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_2/MatMul:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 10" offset="2678800" size="40"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential/dense_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/dense_2/BiasAdd:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential/dense_2/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Func/StatefulPartitionedCall/output/_7:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential/dense_2/Softmax:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Func/StatefulPartitionedCall/output/_7:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="0" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.0-3839-cd81789d294-releases/2021/4"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input value="flatten_input"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,784]"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="saved_model"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{'flatten_input': &lt;class 'numpy.float32'&gt;}"/>
			<placeholder_shapes value="{'flatten_input': array([  1, 784])}"/>
			<progress value="False"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_model, move_to_preprocess, output, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
